Repository: ibrahim-h/dictionariesAlmaany
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar, tr

source: Dictionaries Almaany
ar: قواميس المَعاني
tr: Almaany Sözlükleri

source: Get the meaning of selected word by Dictionaries Almaany, and if no selection, Opens Dictionaries Almaany dialog to enter a word and get it's meaning .
ar: الحصول على معنى الكلمة المُحددة بواسطةْ قواميس المَعاني,و إذا لم يكن هناك تحديد, يتم فتح محاورةْ قواميس المَعاني لإدخال كلمة و إيجاد معناها.
tr: Seçilen kelimenin anlamını Almaany Sözlükleri ile alır ve seçim yoksa, bir kelime girmek ve anlamını öğrenmek için Almaany Sözlükleri diyalog penceresini açar.

source: Choose default dictionary:
ar: اخترْ القاموس الإفتراضي:
tr: Varsayılan sözlüğü seçin:

source: Default full browser
ar: المتصفح الإفتراضي العادي
tr: Varsayılan tam tarayıcı

source: Browser window only
ar: نافذةْ المتصفح فقط
tr: Yalnızca tarayıcı penceresi

source: NVDA browseable message box(choose it after testing)
ar: نافذةْ NVDA الخاصة بالتصفح(مِن الأفضل تجربتها قبل الإختيار)
tr: NVDA göz atılabilir mesaj kutusu(test ettikten sonra seçin)

source: Choose type of window To Display Result:
ar: اختيار نافذةْ النتائج:
tr: Sonucun gösterileceği pencere türünü seçin:

source: Close Dictionaries almaany Dialog after requesting translation
ar: إغلاق محاورةْ قواميس المَعاني بعد طلب معنى الكلمة
tr: Çeviri talebinden sonra Almaany Sözlükleri İletişim Kutusunu kapat

source: Check for update on startup
tr: Başlangıçta güncellemeleri denetle

source: Enter a word please
ar: أَدْخِلْ كلمة فضلا
tr: Lütfen bir kelime yazın

source: Choose Dictionary
ar: إختر القاموس
tr: Sözlük Seçin

source: OK
ar: موافق
tr: Tamam

source: cancel
ar: إلغاء
tr: iptal

source: No meaning found
ar: لم يتم إيجاد معنى
tr: Anlam bulunamadı

source: Most likely no internet connection
ar: أغلب الظن أنه لا يوجد إتصال بالإنترنت
tr: Büyük ihtimalle internet bağlantısı yok

source: Sorry, An Error Happened
ar: عُذراً, لقد حصلَ خَطَأ
tr: Üzgünüz, Bir Hata Oluştu

source: It is available a new version {} of this add-on. Do you want to update?
tr: Bu eklentinin yeni bir sürümü {} mevcut. Güncellemek istiyor musunuz?

source: {}-Update
tr: {}-Güncelle

source: This new version of this add-on is not compatible with your version of NVDA. The update process will be terminated.
tr: Eklentinin yeni sürümü, NVDA sürümünüzle uyumlu değil. Güncelleme işlemi sonlandırılacak.

source: This addon helps get the meaning of single words from www.almaany.com website. Press nvda+windows+d, dictionaries almaany dialog will be displayed, and you will be standing on an edit field. If when pressing this command, you were standing on a selected word, you will access the translation result directly using default dictionary. You can change the default dictionary of the addon, from the addon's setting panel through preferences menu. Otherwise, enter in the edit field the word you want, tab an choose the dictionary you want and press enter. The meaning of the word will be displayed in a separate browseable message box.
tr: Bu eklenti, www.almaany.com web sitesinden kelimelerin anlamlarını almanıza yardımcı olur. Nvda+windows+d tuşlarına basın, Almaany sözlükleri iletişim kutusu görüntülenecek ve bir yazma alanına odaklanacaksınız. Bu tuşlara basarken seçilen bir kelimenin üzerinde duruyorsanız, varsayılan sözlüğü kullanarak çeviri sonucuna doğrudan erişeceksiniz. Eklentinin varsayılan sözlüğünü, tercihler menüsünden eklentinin ayar panelinden değiştirebilirsiniz. Aksi takdirde, düzenleme alanına istediğiniz sözcüğü girin, sekme tuşuna basıp istediğiniz sözlüğü seçin ve enter tuşuna basın. Kelimenin anlamı ayrı bir göz atılabilir mesaj kutusunda görüntülenecektir.

source: This addon helps get the meaning of single words from www.almaany.com website. Press nvda+windows+d, dictionaries almaany dialog will be displayed, and you will be standing on an edit field. You can change the default dictionary of the addon, from the addon's setting panel through preferences menu. If when pressing this command, you were standing on a selected word, you will access the translation result directly. Otherwise, enter in the edit field the word you want, tab an choose the dictionary you want and press enter. The meaning of the word will be displayed in a separate browseable message box.
ar: هذه الإضافة تساعدك على الحصول على معاني الكلمات, من خلال موقع www.almaany.com. بالضغط على الإختصار nvda+windows+d, ستظهر لك محاورةْ قواميس المعاني, و ستكون واقفا على مربع تحرير. و تستطيع دائما تغيير القاموس الإفتراضي, مِن شريط إعدادات الإضافة, و الذي تصل إليه مِن قائمةْ الإعدادات. و عند ضغط الإختصار, إذا كنتَ واقفا على كلمة محددة, ستحصل فورا على معنى الكلمة في القاموس الإفتراضي. أو عند فتح محاورةْ الإضافة, اكتب في مربع التحرير الكلمة التي تريد, ثم إضغط تاب لتقف على قائمةْ القواميس إختر منها القاموس الذي تريد و اضغطْ عليه إنتر. و بعد ذاك, سيظهر معنى الكلمة في browseable message box أو نافذة تستطيع قراءتها و التنقل فيها كما في المتصفح.
